app/controllers/api/taskers_controller.rb

  def index
    puts "im in taskers index ocntroller"
     @taskers = Tasker.all
---
SELECT "taskers".* FROM "taskers"