app/controllers/api/taskers_controller.rb

SELECT "taskers".* FROM "taskers" WHERE "taskers"."task_category" = $1  [["task_category", "Mounting "]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4, $5, $6)  [["id", 1], ["id", 7], ["id", 8], ["id", 9], ["id", 10], ["id", 11]]
---
  def index

     @taskers = Tasker.where(task_category: params[:task_category]).includes(:user)