app/controllers/api/taskcategories_controller.rb

SELECT "taskcategories".* FROM "taskcategories"
---
  def index
     @task_categories = Taskcategory.all