app/views/api/taskers/index.json.jbuilder

    end
  json.firstname tasker.user.firstname
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]